#html (no single quote allowed)
invalid.field.badInput=\u041D\u0435\u0434\u0430\u043F\u0443\u0448\u0447\u0430\u043B\u044C\u043D\u0430\u0435 \u0437\u043D\u0430\u0447\u044D\u043D\u043D\u0435.
invalid.field.text.empty=\u041D\u0435 \u043F\u0430\u0432\u0456\u043D\u043D\u0430 \u0431\u044B\u0446\u044C \u043F\u0443\u0441\u0442\u044B\u043C.
invalid.field.number.negative=\u041D\u0435 \u043F\u0430\u0432\u0456\u043D\u043D\u0430 \u0431\u044B\u0446\u044C \u0430\u0434\u043C\u043E\u045E\u043D\u044B\u043C.
invalid.field.number.NaN=\u041A\u0430\u043B\u0456 \u043B\u0430\u0441\u043A\u0430, \u0443\u0432\u044F\u0434\u0437\u0456\u0446\u0435 \u043B\u0456\u043A.

#product
pattern.product.productId.validation=\u041D\u044F\u043F\u0440\u0430\u0432\u0456\u043B\u044C\u043D\u044B ID \u043F\u0440\u0430\u0434\u0443\u043A\u0442\u0443. \u0401\u043D \u043F\u0430\u0432\u0456\u043D\u0435\u043D \u043F\u0430\u0447\u044B\u043D\u0430\u0446\u0446\u0430 \u0437 \u0437\u043D\u0430\u043A\u0430 'P', \u0437\u0430 \u044F\u043A\u0456\u043C \u0432\u0430\u0440\u0442\u0430 \u043B\u0456\u043A.
pattern.product.name.validation=\u041D\u044F\u043F\u0440\u0430\u0432\u0456\u043B\u044C\u043D\u0430\u044F \u043D\u0430\u0437\u0432\u0430 \u043F\u0440\u0430\u0434\u0443\u043A\u0442\u0443. \u0414\u0430\u045E\u0436\u044B\u043D\u044F \u043F\u0430\u0432\u0456\u043D\u043D\u0430 \u0431\u044B\u0446\u044C \u043D\u0435 \u043C\u0435\u043D\u0448 \u0437\u0430 4 \u0456 \u043D\u0435 \u0431\u043E\u043B\u044C\u0448 \u0437\u0430 50 \u0437\u043D\u0430\u043A\u0430\u045E.
pattern.product.unitPrice.validation.min=\u041D\u044F\u043F\u0440\u0430\u0432\u0456\u043B\u044C\u043D\u044B \u0444\u0430\u0440\u043C\u0430\u0442 \u0446\u0430\u043D\u044B. \u041D\u0435 \u043C\u043E\u0436\u0430 \u0431\u044B\u0446\u044C \u0430\u0434\u043C\u043E\u045E\u043D\u0430\u0439 \u0432\u0435\u043B\u0456\u0447\u044B\u043D\u0451\u0439.
pattern.product.unitPrice.validation.digits=\u041D\u044F\u043F\u0440\u0430\u0432\u0456\u043B\u044C\u043D\u044B \u0444\u0430\u0440\u043C\u0430\u0442 \u0446\u0430\u043D\u044B. \u041C\u043E\u0436\u0430 \u043C\u0435\u0446\u044C \u043C\u0430\u043A\u0441\u0456\u043C\u0443\u043C 8 \u043B\u0456\u0447\u0431\u0430\u045E \u0446\u044D\u043B\u0430\u0433\u0430 \u043B\u0456\u043A\u0443 \u0456 2 \u0434\u0440\u043E\u0431\u0430\u0432\u0430\u044F \u043B\u0456\u0447\u0431\u044B.
pattern.product.unitPrice.validation.notNull=\u041D\u044F\u043F\u0440\u0430\u0432\u0456\u043B\u044C\u043D\u044B \u0444\u0430\u0440\u043C\u0430\u0442 \u0446\u0430\u043D\u044B. \u041D\u0435 \u043C\u043E\u0436\u0430 \u0431\u044B\u0446\u044C \u043F\u0443\u0441\u0442\u043E\u0439.
pattern.product.manufacturer.validation=\u041D\u044F\u043F\u0440\u0430\u0432\u0456\u043B\u044C\u043D\u0430\u044F \u043D\u0430\u0437\u0432\u0430 \u0432\u044B\u0442\u0432\u043E\u0440\u0446\u044B. \u041D\u0435 \u043C\u043E\u0436\u0430 \u0431\u044B\u0446\u044C \u043F\u0443\u0441\u0442\u043E\u0439.
pattern.product.category.validation=\u041D\u044F\u043F\u0440\u0430\u0432\u0456\u043B\u044C\u043D\u0430\u044F \u043D\u0430\u0437\u0432\u0430 \u043A\u0430\u0442\u044D\u0433\u043E\u0440\u044B\u0456. \u041D\u0435 \u043C\u043E\u0436\u0430 \u0431\u044B\u0446\u044C \u043F\u0443\u0441\u0442\u043E\u0439.
pattern.product.unitsInStock.validation=\u041D\u044F\u043F\u0440\u0430\u0432\u0456\u043B\u044C\u043D\u0430\u044F \u043A\u043E\u043B\u044C\u043A\u0430\u0441\u0446\u044C \u043D\u0430 \u0441\u043A\u043B\u0430\u0434\u0437\u0435. \u041D\u0435 \u043C\u043E\u0436\u0430 \u0431\u044B\u0446\u044C \u0430\u0434\u043C\u043E\u045E\u043D\u0430\u0439 \u0432\u0435\u043B\u0456\u0447\u044B\u043D\u0451\u0439.
pattern.product.unitsInOrder.validation=\u041D\u044F\u043F\u0440\u0430\u0432\u0456\u043B\u044C\u043D\u0430\u044F \u043A\u043E\u043B\u044C\u043A\u0430\u0441\u0446\u044C \u0443 \u0437\u0430\u043A\u0430\u0437\u0435. \u041D\u0435 \u043C\u043E\u0436\u0430 \u0431\u044B\u0446\u044C \u0430\u0434\u043C\u043E\u045E\u043D\u0430\u0439 \u0432\u0435\u043B\u0456\u0447\u044B\u043D\u0451\u0439.
validator.productId.message=\u041F\u0440\u0430\u0434\u0443\u043A\u0442 \u0437 \u0437 \u0442\u0430\u043A\u0456\u043C ID \u0443\u0436\u043E \u0456\u0441\u043D\u0443\u0435.
validator.category.message=\u041A\u0430\u0442\u044D\u0433\u043E\u0440\u044B\u044F \u043F\u0430\u0432\u0456\u043D\u043D\u0430 \u0431\u044B\u0446\u044C \u0430\u0434\u043D\u0430 \u0437 \u043D\u0430\u0441\u0442\u0443\u043F\u043D\u044B\u0445:
validator.unitsInStock.message=\u0412\u044B \u043D\u0435 \u043C\u043E\u0436\u0430\u0446\u0435 \u0434\u0430\u0434\u0430\u0446\u044C \u0431\u043E\u043B\u044C\u0448, \u0447\u044B\u043C {0} \u0448\u0442., \u043A\u0430\u043B\u0456 \u043A\u043E\u0448\u0442 \u0437\u0430 \u0448\u0442\u0443\u043A\u0443 \u0431\u043E\u043B\u044C\u0448, \u0447\u044B\u043C {1}.
validator.productImage.size.message=\u041F\u0430\u043C\u0435\u0440 \u0444\u0430\u0439\u043B\u0430 \u043A\u0430\u0440\u0446\u0456\u043D\u043A\u0456 \u043F\u0430\u0432\u0456\u043D\u0435\u043D \u0431\u044B\u0446\u044C \u043C\u0435\u043D\u0448 {0}.

#customer
pattern.customer.customerId.validation=\u041D\u044F\u043F\u0440\u0430\u0432\u0456\u043B\u044C\u043D\u044B ID \u043F\u0430\u043A\u0443\u043F\u043D\u0456\u043A\u0430. \u0401\u043D \u043F\u0430\u0432\u0456\u043D\u0435\u043D \u043F\u0430\u0447\u044B\u043D\u0430\u0446\u0446\u0430 \u0437 \u0437\u043D\u0430\u043A\u0430 'C', \u0437\u0430 \u044F\u043A\u0456\u043C \u0432\u0430\u0440\u0442\u0430 \u043B\u0456\u043A.
pattern.customer.name.validation=\u041D\u044F\u043F\u0440\u0430\u0432\u0456\u043B\u044C\u043D\u0430\u0435 \u0456\u043C\u044F \u043F\u0430\u043A\u0443\u043F\u043D\u0456\u043A\u0430. \u041D\u0435 \u043C\u043E\u0436\u0430 \u0431\u044B\u0446\u044C \u043F\u0443\u0441\u0442\u044B\u043C.
pattern.customer.address.validation=\u041D\u044F\u043F\u0440\u0430\u0432\u0456\u043B\u044C\u043D\u044B \u0430\u0434\u0440\u0430\u0441 \u043F\u0430\u043A\u0443\u043F\u043D\u0456\u043A\u0430. \u041D\u0435 \u043C\u043E\u0436\u0430 \u0431\u044B\u0446\u044C \u043F\u0443\u0441\u0442\u044B\u043C.
pattern.customer.madeOrders.validation=\u041D\u044F\u043F\u0440\u0430\u0432\u0456\u043B\u044C\u043D\u0430\u044F \u043A\u043E\u043B\u044C\u043A\u0430\u0441\u0446\u044C \u0437\u0440\u043E\u0431\u043B\u0435\u043D\u044B\u0445 \u0437\u0430\u043A\u0430\u0437\u0430\u045E. \u041D\u0435 \u043C\u043E\u0436\u0430 \u0431\u044B\u0446\u044C \u0430\u0434\u043C\u043E\u045E\u043D\u0430\u0439 \u0432\u0435\u043B\u0456\u0447\u044B\u043D\u0451\u0439.